; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite3 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	spectrograph2 - mode
	spectrograph0 - mode
	thermograph1 - mode
	Star2 - direction
	Star6 - direction
	Star8 - direction
	GroundStation0 - direction
	Star3 - direction
	Star7 - direction
	GroundStation5 - direction
	GroundStation1 - direction
	GroundStation4 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
)
(:init
	(supports instrument0 spectrograph2)
	(supports instrument0 thermograph1)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 GroundStation0)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star9)
	(supports instrument1 spectrograph0)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star3)
	(calibration_target instrument1 GroundStation4)
	(calibration_target instrument1 GroundStation5)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
	(supports instrument2 thermograph1)
	(supports instrument2 spectrograph0)
	(supports instrument2 spectrograph2)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 Star3)
	(calibration_target instrument2 GroundStation0)
	(supports instrument3 spectrograph2)
	(calibration_target instrument3 GroundStation5)
	(calibration_target instrument3 Star7)
	(on_board instrument2 satellite2)
	(on_board instrument3 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star7)
	(calibration_target instrument4 GroundStation4)
	(supports instrument5 thermograph1)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 GroundStation1)
	(calibration_target instrument5 GroundStation5)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 GroundStation4)
	(on_board instrument4 satellite3)
	(on_board instrument5 satellite3)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Planet16)
)
(:goal (and
	(pointing satellite3 Planet16)
	(have_image Star9 thermograph1)
	(have_image Planet10 spectrograph2)
	(have_image Phenomenon11 spectrograph2)
	(have_image Phenomenon12 spectrograph0)
	(have_image Planet13 spectrograph0)
	(have_image Phenomenon14 spectrograph2)
	(have_image Star15 spectrograph0)
	(have_image Planet16 thermograph1)
	(have_image Star17 spectrograph2)
))

)

; plan
1. (turn_to satellite2 groundstation0 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 groundstation0)
   goals met: 1 of 10
2. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 1 of 10
3. (calibrate satellite2 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 1 of 10
4. (turn_to satellite2 planet13 groundstation0)
   deleted: (pointing satellite2 groundstation0)
   added: (pointing satellite2 planet13)
   goals met: 1 of 10
5. (take_image satellite2 planet13 instrument2 spectrograph0)
   added: (have_image planet13 spectrograph0)
   goals met: 2 of 10
6. (turn_to satellite2 planet10 planet13)
   deleted: (pointing satellite2 planet13)
   added: (pointing satellite2 planet10)
   goals met: 2 of 10
7. (take_image satellite2 planet10 instrument2 spectrograph2)
   added: (have_image planet10 spectrograph2)
   goals met: 3 of 10
8. (turn_to satellite2 phenomenon14 planet10)
   deleted: (pointing satellite2 planet10)
   added: (pointing satellite2 phenomenon14)
   goals met: 3 of 10
9. (take_image satellite2 phenomenon14 instrument2 spectrograph2)
   added: (have_image phenomenon14 spectrograph2)
   goals met: 4 of 10
10. (turn_to satellite2 phenomenon12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 phenomenon12)
   goals met: 4 of 10
11. (take_image satellite2 phenomenon12 instrument2 spectrograph0)
   added: (have_image phenomenon12 spectrograph0)
   goals met: 5 of 10
12. (turn_to satellite2 phenomenon11 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 phenomenon11)
   goals met: 5 of 10
13. (take_image satellite2 phenomenon11 instrument2 spectrograph2)
   added: (have_image phenomenon11 spectrograph2)
   goals met: 6 of 10
14. (turn_to satellite2 planet16 phenomenon11)
   deleted: (pointing satellite2 phenomenon11)
   added: (pointing satellite2 planet16)
   goals met: 6 of 10
15. (take_image satellite2 planet16 instrument2 thermograph1)
   added: (have_image planet16 thermograph1)
   goals met: 7 of 10
16. (turn_to satellite2 star15 planet16)
   deleted: (pointing satellite2 planet16)
   added: (pointing satellite2 star15)
   goals met: 7 of 10
17. (take_image satellite2 star15 instrument2 spectrograph0)
   added: (have_image star15 spectrograph0)
   goals met: 8 of 10
18. (turn_to satellite2 star17 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 star17)
   goals met: 8 of 10
19. (take_image satellite2 star17 instrument2 spectrograph2)
   added: (have_image star17 spectrograph2)
   goals met: 9 of 10
20. (turn_to satellite2 star9 star17)
   deleted: (pointing satellite2 star17)
   added: (pointing satellite2 star9)
   goals met: 9 of 10
21. (take_image satellite2 star9 instrument2 thermograph1)
   added: (have_image star9 thermograph1)
   goals met: 10 of 10
